MikroElektronika/core_packages/ARM/gcc_clang/def/gigadevice/GD32G553RCT7/mcu.h
/* main flash and SRAM memory map */
#define FLASH_BASE            ((uint32_t)0x08000000U)       /*!< main FLASH base address */
#define SRAM_BASE             ((uint32_t)0x20000000U)       /*!< SRAM base address */

/* peripheral memory map */
#define APB1_BUS_BASE         ((uint32_t)0x40000000U)       /*!< APB1 base address */
#define APB2_BUS_BASE         ((uint32_t)0x40010000U)       /*!< APB2 base address */
#define APB3_BUS_BASE         ((uint32_t)0x50000000U)       /*!< APB3 base address */
#define AHB1_BUS_BASE         ((uint32_t)0x40020000U)       /*!< AHB1 base address */
#define AHB2_BUS_BASE         ((uint32_t)0x48000000U)       /*!< AHB2 base address */
#define AHB3_BUS_BASE         ((uint32_t)0x60000000U)       /*!< AHB3 base address */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE            (APB1_BUS_BASE + 0x00000000U) /*!< TIMER base address */
#define RTC_BASE              (APB1_BUS_BASE + 0x00002800U) /*!< RTC base address */
#define WWDGT_BASE            (APB1_BUS_BASE + 0x00002C00U) /*!< WWDGT base address */
#define FWDGT_BASE            (APB1_BUS_BASE + 0x00003000U) /*!< FWDGT base address */
#define SPI_BASE              (APB1_BUS_BASE + 0x00003800U) /*!< SPI base address */
#define USART_BASE            (APB1_BUS_BASE + 0x00004400U) /*!< USART base address */
#define I2C_BASE              (APB1_BUS_BASE + 0x00005400U) /*!< I2C base address */
#define PMU_BASE              (APB1_BUS_BASE + 0x00007000U) /*!< PMU base address */
#define LPTIMER_BASE          (APB1_BUS_BASE + 0x00009400U) /*!< LPTIMER base address */

/* advanced peripheral bus 2 memory map */
#define SYSCFG_BASE           (APB2_BUS_BASE + 0x00000000U) /*!< SYSCFG base address */
#define EXTI_BASE             (APB2_BUS_BASE + 0x00000400U) /*!< EXTI base address */
#define HRTIMER_BASE          (APB2_BUS_BASE + 0x00005800U) /*!< HRTIMER base address */
#define HPDF_BASE             (APB2_BUS_BASE + 0x00007000U) /*!< HPDF base address */
#define VREF_BASE             (APB2_BUS_BASE + 0x00007800U) /*!< VREF base address */
#define CMP_BASE              (APB2_BUS_BASE + 0x00007C00U) /*!< CMP base address */
#define TRIGSEL_BASE          (APB2_BUS_BASE + 0x00008400U) /*!< TRIGSEL base address */
#define CAN_BASE              (APB2_BUS_BASE + 0x0000A000U) /*!< CAN base address */

/* advanced high performance bus 1 memory map */
#define DMA_BASE              (AHB1_BUS_BASE + 0x00000000U) /*!< DMA base address */
#define DMAMUX_BASE           (AHB1_BUS_BASE + 0x00000800U) /*!< DMAMUX base address */
#define RCU_BASE              (AHB1_BUS_BASE + 0x00001000U) /*!< RCU base address */
#define FMC_BASE              (AHB1_BUS_BASE + 0x00002000U) /*!< FMC base address */
#define CRC_BASE              (AHB1_BUS_BASE + 0x00003000U) /*!< CRC base address */
#define FFT_BASE              (AHB1_BUS_BASE + 0x00005000U) /*!< FFT base address */
#define CLA_BASE              (AHB1_BUS_BASE + 0x00018000U) /*!< CLA base address */

/* advanced high performance bus 2 memory map */
#define GPIO_BASE             (AHB2_BUS_BASE + 0x00000000U) /*!< GPIO base address */
#define CAU_BASE              (AHB2_BUS_BASE + 0x00021000U) /*!< CAU base address */
#define TRNG_BASE             (AHB2_BUS_BASE + 0x00021800U) /*!< TRNG base address */
#define CPDM_BASE             (AHB2_BUS_BASE + 0x00022800U) /*!< CPDM base address */
#define TMU_BASE              (AHB2_BUS_BASE + 0x00024400U) /*!< TMU base address */
#define FAC_BASE              (AHB2_BUS_BASE + 0x00024800U) /*!< FAC base address */

/* advanced peripheral bus 3 memory map */
#define ADC_BASE              (APB3_BUS_BASE + 0x00000000U) /*!< ADC base address */
#define DAC_BASE              (APB3_BUS_BASE + 0x00001000U) /*!< DAC base address */

/* advanced high performance bus 3 memory map */
#define EXMC_BASE             (AHB3_BUS_BASE + 0x40000000U) /*!< EXMC base address */
#define QSPI_BASE             (AHB3_BUS_BASE + 0x40001000U) /*!< QSPI base address */

/* option byte and debug memory map */
#define OB_BASE               ((uint32_t)0x1FFFF800U)       /*!< OB base address */
#define DBG_BASE              ((uint32_t)0xE0044000U)       /*!< DBG base address */
// #include "gd32g5x3_libopt.h"  // Note: Changed for MikroE implementation.

#ifdef __cplusplus
}
#endif

#endif /* GD32G5X3_H */
